import pytest


@pytest.fixture
def fixture_user_settings() -> dict:
    """
    Фикстура настроек пользователя
    """
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}


@pytest.fixture
def fixture_greeting() -> str:
    """
    Фикстура приветствия
    """
    return "Добрый день"


@pytest.fixture
def fixture_list_user_operations_two_days() -> list:
    """
    Фикстура операций пользователя за два дня
    """
    return [
        {
            "Дата операции": "02.11.2021 18:22:08",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -60.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -60.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Mouse Tail",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 60.0,
        },
        {
            "Дата операции": "02.11.2021 18:03:20",
            "Дата платежа": "04.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -60.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -60.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Местный транспорт",
            "MCC": 4111.0,
            "Описание": "Метро Санкт-Петербург",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 60.0,
        },
        {
            "Дата операции": "02.11.2021 18:01:05",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -7.97,
            "Валюта операции": "RUB",
            "Сумма платежа": -7.97,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 7.97,
        },
        {
            "Дата операции": "02.11.2021 16:20:22",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -90.65,
            "Валюта операции": "RUB",
            "Сумма платежа": -90.65,
            "Валюта платежа": "RUB",
            "Кэшбэк": 4.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 90.65,
        },
        {
            "Дата операции": "02.11.2021 16:18:19",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -57.16,
            "Валюта операции": "RUB",
            "Сумма платежа": -57.16,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 57.16,
        },
        {
            "Дата операции": "02.11.2021 11:59:48",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -53.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -53.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 53.99,
        },
        {
            "Дата операции": "02.11.2021 11:56:26",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -68.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -68.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 3.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 68.0,
        },
        {
            "Дата операции": "02.11.2021 10:05:06",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -69.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -69.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": 3.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 69.99,
        },
        {
            "Дата операции": "02.11.2021 09:32:23",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 110,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5510.8,
        },
        {
            "Дата операции": "01.11.2021 15:32:24",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -228.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -228.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 11.0,
            "Категория": "Мобильная связь",
            "MCC": 5411.0,
            "Описание": "МТС Mobile +7 981 333-44-55",
            "Бонусы (включая кэшбэк)": 11,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 228.0,
        },
        {
            "Дата операции": "01.11.2021 11:01:19",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -110.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -110.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Мобильная связь",
            "MCC": 5814.0,
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 110.0,
        },
    ]


@pytest.fixture
def fixture_list_user_operations_three_days() -> list:
    """
    Фикстура операций пользователя за три дня
    """
    return [
        {
            "Дата операции": "03.11.2021 22:40:58",
            "Дата платежа": "04.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -28.41,
            "Валюта операции": "RUB",
            "Сумма платежа": -28.41,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 28.41,
        },
        {
            "Дата операции": "03.11.2021 22:23:15",
            "Дата платежа": "04.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -60.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -60.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Evo_Khochukofe",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 60.0,
        },
        {
            "Дата операции": "03.11.2021 18:10:29",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -191.5,
            "Валюта операции": "RUB",
            "Сумма платежа": -191.5,
            "Валюта платежа": "RUB",
            "Кэшбэк": 9.0,
            "Категория": "Косметика",
            "MCC": 5977.0,
            "Описание": "Улыбка радуги",
            "Бонусы (включая кэшбэк)": 9,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 191.5,
        },
        {
            "Дата операции": "03.11.2021 16:11:23",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -10.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -10.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 7379.0,
            "Описание": "Devajs Servis.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 10.0,
        },
        {
            "Дата операции": "03.11.2021 14:05:54",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -96.98,
            "Валюта операции": "RUB",
            "Сумма платежа": -96.98,
            "Валюта платежа": "RUB",
            "Кэшбэк": 4.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 96.98,
        },
        {
            "Дата операции": "03.11.2021 13:59:23",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": 10000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 10000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Другое",
            "MCC": 0,
            "Описание": "Иван С.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 10000.0,
        },
        {
            "Дата операции": "03.11.2021 13:22:06",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -10.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -10.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 7379.0,
            "Описание": "Devajs Servis.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 10.0,
        },
        {
            "Дата операции": "03.11.2021 13:14:19",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -153.29,
            "Валюта операции": "RUB",
            "Сумма платежа": -153.29,
            "Валюта платежа": "RUB",
            "Кэшбэк": 7.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 153.29,
        },
        {
            "Дата операции": "03.11.2021 13:03:16",
            "Дата платежа": "03.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -56.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -56.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Rumyanyj Khleb",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 56.0,
        },
        {
            "Дата операции": "02.11.2021 18:22:08",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -60.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -60.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Mouse Tail",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 60.0,
        },
        {
            "Дата операции": "02.11.2021 18:03:20",
            "Дата платежа": "04.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -60.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -60.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Местный транспорт",
            "MCC": 4111.0,
            "Описание": "Метро Санкт-Петербург",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 60.0,
        },
        {
            "Дата операции": "02.11.2021 18:01:05",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -7.97,
            "Валюта операции": "RUB",
            "Сумма платежа": -7.97,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 7.97,
        },
        {
            "Дата операции": "02.11.2021 16:20:22",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -90.65,
            "Валюта операции": "RUB",
            "Сумма платежа": -90.65,
            "Валюта платежа": "RUB",
            "Кэшбэк": 4.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 90.65,
        },
        {
            "Дата операции": "02.11.2021 16:18:19",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -57.16,
            "Валюта операции": "RUB",
            "Сумма платежа": -57.16,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 57.16,
        },
        {
            "Дата операции": "02.11.2021 11:59:48",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -53.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -53.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 53.99,
        },
        {
            "Дата операции": "02.11.2021 11:56:26",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -68.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -68.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 3.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 68.0,
        },
        {
            "Дата операции": "02.11.2021 10:05:06",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -69.99,
            "Валюта операции": "RUB",
            "Сумма платежа": -69.99,
            "Валюта платежа": "RUB",
            "Кэшбэк": 3.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 69.99,
        },
        {
            "Дата операции": "02.11.2021 09:32:23",
            "Дата платежа": "02.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 110,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5510.8,
        },
        {
            "Дата операции": "01.11.2021 15:32:24",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -228.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -228.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 11.0,
            "Категория": "Мобильная связь",
            "MCC": 5411.0,
            "Описание": "МТС Mobile +7 981 333-44-55",
            "Бонусы (включая кэшбэк)": 11,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 228.0,
        },
        {
            "Дата операции": "01.11.2021 11:01:19",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -110.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -110.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Мобильная связь",
            "MCC": 5814.0,
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 110.0,
        },
    ]


@pytest.fixture
def fixture_list_sum_operations() -> list[dict]:
    """
    Фикстура суммы операций по картам пользователя
    """
    return [
        {"last_digits": "*4556", "total_spent": 737.79, "cashback": 1},
        {"last_digits": "*7197", "total_spent": 5578.77, "cashback": 110},
    ]


@pytest.fixture
def fixture_list_top_five_transactions() -> list[dict]:
    """
    Фикстура ТОП-5 операций пользователя
    """
    return [
        {"date": "02.11.2021", "amount": 5510.8, "category": "Каршеринг", "description": "Ситидрайв"},
        {
            "date": "01.11.2021",
            "amount": 228.0,
            "category": "Мобильная связь",
            "description": "МТС Mobile +7 981 333-44-55",
        },
        {
            "date": "01.11.2021",
            "amount": 110.0,
            "category": "Мобильная связь",
            "description": "Тинькофф Мобайл +7 995 555-55-55",
        },
        {"date": "02.11.2021", "amount": 90.65, "category": "Супермаркеты", "description": "Колхоз"},
        {"date": "02.11.2021", "amount": 69.99, "category": "Супермаркеты", "description": "Магнит"},
    ]


@pytest.fixture
def fixture_exchange_rates_now() -> list[dict]:
    """
    Фикстура катеровок валют
    """
    return [{"currency": "USD", "rate": 79.67}, {"currency": "EUR", "rate": 93.58}]


@pytest.fixture
def fixture_stock_prices_now() -> list[dict]:
    """
    Фикстура катеровок акций
    """
    return [
        {"stock": "AAPL", "price": "278.28000"},
        {"stock": "AMZN", "price": "226.19000"},
        {"stock": "GOOGL", "price": "309.29001"},
        {"stock": "MSFT", "price": "478.53000"},
        {"stock": "TSLA", "price": "458.95999"},
    ]


@pytest.fixture
def fixture_home_page() -> dict:
    """
    Фикстура json-ответа для главной страницы
    """
    return {
        "greeting": "Добрый день",
        "cards": [
            {"last_digits": "*4556", "total_spent": 737.79, "cashback": 1},
            {"last_digits": "*7197", "total_spent": 5578.77, "cashback": 110},
        ],
        "top_transactions": [
            {"date": "02.11.2021", "amount": 5510.8, "category": "Каршеринг", "description": "Ситидрайв"},
            {
                "date": "01.11.2021",
                "amount": 228.0,
                "category": "Мобильная связь",
                "description": "МТС Mobile +7 981 333-44-55",
            },
            {
                "date": "01.11.2021",
                "amount": 110.0,
                "category": "Мобильная связь",
                "description": "Тинькофф Мобайл +7 995 555-55-55",
            },
            {"date": "02.11.2021", "amount": 90.65, "category": "Супермаркеты", "description": "Колхоз"},
            {"date": "02.11.2021", "amount": 69.99, "category": "Супермаркеты", "description": "Магнит"},
        ],
        "currency_rates": [{"currency": "USD", "rate": 79.67}, {"currency": "EUR", "rate": 93.58}],
        "stock_prices": [
            {"stock": "AAPL", "price": "278.28000"},
            {"stock": "AMZN", "price": "226.19000"},
            {"stock": "GOOGL", "price": "309.29001"},
            {"stock": "MSFT", "price": "478.53000"},
            {"stock": "TSLA", "price": "458.95999"},
        ],
    }


@pytest.fixture
def fixture_search_by_phone_number() -> str:
    """
    Фикстура поиска по телефону
    """
    return (
        '[{"Дата операции": "01.11.2021 15:32:24", "Дата платежа": "01.11.2021", "Номер карты": "*4556", '
        '"Статус": "OK", "Сумма операции": -228.0, "Валюта операции": "RUB", "Сумма платежа": -228.0, '
        '"Валюта платежа": "RUB", "Кэшбэк": 11.0, "Категория": "Мобильная связь", "MCC": 5411.0, "Описание": '
        '"МТС Mobile +7 981 333-44-55", "Бонусы (включая кэшбэк)": 11, "Округление на инвесткопилку": 0, "Сумма '
        'операции с округлением": 228.0}, {"Дата операции": "01.11.2021 11:01:19", "Дата платежа": "01.11.2021", '
        '"Номер карты": "*4556", "Статус": "OK", "Сумма операции": -110.0, "Валюта операции": "RUB", "Сумма '
        'платежа": -110.0, "Валюта платежа": "RUB", "Кэшбэк": 1.0, "Категория": "Мобильная связь", "MCC": '
        '5814.0, "Описание": "Тинькофф Мобайл +7 995 555-55-55", "Бонусы (включая кэшбэк)": 1, "Округление на '
        'инвесткопилку": 0, "Сумма операции с округлением": 110.0}]'
    )


@pytest.fixture
def fixture_spending_by_category() -> list[dict]:
    """
    Фикстура поиска по категории
    """
    return [
        {
            "Дата операции": "01.11.2021 15:32:24",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -228.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -228.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 11.0,
            "Категория": "Мобильная связь",
            "MCC": 5411.0,
            "Описание": "МТС Mobile +7 981 333-44-55",
            "Бонусы (включая кэшбэк)": 11,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 228.0,
        },
        {
            "Дата операции": "01.11.2021 11:01:19",
            "Дата платежа": "01.11.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -110.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -110.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Мобильная связь",
            "MCC": 5814.0,
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 110.0,
        },
    ]
